1211lala/FreeRTOS/2 - 任务的挂起和恢复/函数恢复/STM32F411CEU6_FreeRTOS/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stdio.h"
#include "stdlib.h"
#include "string.h"
#include "usart.h"
#include "tim.h"
#include "gpio.h"


#include ".\COLOR\color.h"
#include ".\LCD\tftlcd.h"
#include ".\MALLOC\malloc.h"
#include ".\WS2812\ws2812.h"
#include ".\MPU6050\mpu6050.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Key_Pin GPIO_PIN_13
#define Key_GPIO_Port GPIOC
#define Key_EXTI_IRQn EXTI15_10_IRQn
#define led_red_Pin GPIO_PIN_0
#define led_red_GPIO_Port GPIOA
#define led_green_Pin GPIO_PIN_1
#define led_green_GPIO_Port GPIOA
#define led_blue_Pin GPIO_PIN_2
#define led_blue_GPIO_Port GPIOA
#define mpu6050_scl_Pin GPIO_PIN_0
#define mpu6050_scl_GPIO_Port GPIOB
#define mpu6050_sda_Pin GPIO_PIN_1
#define mpu6050_sda_GPIO_Port GPIOB
#define mpu6050_INT_Pin GPIO_PIN_2
#define mpu6050_INT_GPIO_Port GPIOB
#define mpu6050_INT_EXTI_IRQn EXTI2_IRQn
#define LCD_DC_Pin GPIO_PIN_4
#define LCD_DC_GPIO_Port GPIOB
#define LCD_RST_Pin GPIO_PIN_6
#define LCD_RST_GPIO_Port GPIOB
#define LCD_PWR_Pin GPIO_PIN_7
#define LCD_PWR_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
